In [1]:
import pandas as pd

In [2]:
# two main data types
series = pd.Series(["BMW", "Toyota", "Honda"])

In [3]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [4]:
# series = one dimensional

In [5]:
colors = pd.Series(["Red", "Blue", "Red"])

In [6]:
colors

0     Red
1    Blue
2     Red
dtype: object

In [7]:
# Data Frame is 2-D
car_data = pd.DataFrame({"Car Make":series, "Color":colors})
car_data

  Car Make Color
0      BMW   Red
1   Toyota  Blue
2    Honda   Red

In [8]:
# Importing Data

In [9]:
car_sales = pd.read_csv("car-sales.csv")

In [10]:
car_sales

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [11]:
#Exproting a Data Frame

In [12]:
car_sales.to_csv("exported-car-sales.csv", index = False)

In [13]:
#you need to add index = false or it will read the first column as an unknown.

In [14]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")

In [15]:
exported_car_sales

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## describe the data

In [16]:
# This is an attribute it does not have (), it is meta information

In [17]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [18]:
#this is a function and uses (), this will perform different steps

In [19]:
#car_sales.to_csv()

In [20]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [21]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [22]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [23]:
#Let's call some functions

In [24]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [25]:
#this gives us statistical information about our NUMERIC columns, notice that price is an object rather than an int.

In [26]:
car_sales.info

<bound method DataFrame.info of      Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00 >

In [27]:
# info and describe are the very basic ones we will look at to start exploring our data.

In [28]:
car_sales.mean()

TypeError: Could not convert ['ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyotaNissan'
 'WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite'
 '$4,000.00 $5,000.00 $7,000.00 $22,000.00 $3,500.00 $4,500.00 $7,500.00 $7,000.00 $6,250.00 $9,700.00 '] to numeric

In [29]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [30]:
car_sales.mean

<bound method DataFrame.mean of      Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00 >

In [31]:
car_sales.mean()

TypeError: Could not convert ['ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyotaNissan'
 'WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite'
 '$4,000.00 $5,000.00 $7,000.00 $22,000.00 $3,500.00 $4,500.00 $7,500.00 $7,000.00 $6,250.00 $9,700.00 '] to numeric

In [32]:
car_prices = pd.Series([3000, 1500,111250])
car_prices.mean()

38583.333333333336

In [33]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00 $5,000.00 $7,000.00 $22,000.00 $3,50...
dtype: object

In [34]:
#NOt really usefull to call the entire thing, so lets call only one column

In [35]:
car_sales["Doors"].sum()

40

In [36]:
#lets practice picking jsut one column and running mean median mode

In [37]:
car_sales["Odometer (KM)"].mean()

78601.4

In [38]:
car_sales["Doors"].mode()

0    4
Name: Doors, dtype: int64

In [39]:
len(car_sales)

10

In [40]:
car_sales

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [41]:
#len will return the amount of rows in your data set so you can see how much you are working with.

# Selecting and Veiwing Data

In [42]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [43]:
# this returns the first or top 5 rows of your data

In [44]:
# you can also choose how many rows you want rerturned. It will always be the top however many but you can adjust the ammount.

In [45]:
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [46]:
car_sales.head(1)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4  $4,000.00

In [47]:
#The oposite will be tail. This will show you the bottom amount.

In [48]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors       Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [49]:
car_sales.tail(2)

     Make Colour  Odometer (KM)  Doors       Price
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [50]:
car_sales.tail(10)

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [51]:
# .loc() and .iloc()

In [52]:
#you can se up your own custom index if you want, just remember the default starts at 0 and is the most comon

In [57]:
animals = pd.Series(["cat","dog","bird","Panda", "snake"],
             index=[0,3,4,3,7])

In [58]:
animals

0      cat
3      dog
4     bird
3    Panda
7    snake
dtype: object

In [59]:
animals.loc[3]

3      dog
3    Panda
dtype: object

In [61]:
#loc stands for location, so the location 3 holds dog and panda, it also gives us the data type

In [62]:
animals.loc[7]

'snake'

In [63]:
car_sales

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [64]:
car_sales.loc[7]

Make                  Honda
Colour                 Blue
Odometer (KM)         54738
Doors                     4
Price            $7,000.00
Name: 7, dtype: object

In [67]:
#.iloc Looking at this it shows the item in the actual index of 3 so looking at our list if we start at index 0 and count spot 3 is panda.

In [69]:
#.iloc refers to positition.

In [70]:
animals.iloc[3]

'Panda'

In [71]:
car_sales

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [72]:
car_sales.loc[3]
car_sales.iloc[3]

Make                     BMW
Colour                 Black
Odometer (KM)          11179
Doors                      5
Price            $22,000.00
Name: 3, dtype: object

In [73]:
animals.iloc[:3]

0     cat
3     dog
4    bird
dtype: object

In [77]:
#this gives us all the items up to 3 not including 3

In [78]:
car_sales[:5]

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [79]:
car_sales.iloc[:5]

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [81]:
car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [84]:
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [85]:
car_sales["Odometer (KM)"]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [86]:
#this will return the column however lets look at the other method we will get an error

In [88]:
car_sales.Odometer (KM)

AttributeError: 'DataFrame' object has no attribute 'Odometer'

In [89]:
car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [90]:
# this will return only the ones that match make = toyota

In [91]:
car_sales[car_sales["Odometer (KM)"] > 100000]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [92]:
pd.crosstab(car_sales["Make"], car_sales["Doors"])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [93]:
#grabs a column and cross it witht the doors column